import csv
import os

# Создание csv таблицы, если такой нет
def csv_create(platform) -> None:
    if os.path.exists("data.csv"):
        return None
    with open("data.csv", "w", encoding="utf-8") as csv_file:
        writer = csv.writer(csv_file,delimiter='|', quoting=csv.QUOTE_MINIMAL)
        text = ["ФИО ученика", "Класс", "Общее число несовпадений", "Несовпадений по 1 фактору", "Несовпадений по 2 фактору", "Несовпадений по 3 фактору", "Несовпадений по 4 фактору", "Несовпадений по 5 фактору", "Несовпадений по 6 фактору", "Несовпадений по 7 фактору", "Несовпадений по 8 фактору", "Результат", "", "Процент несовпадений по каждому фактору для всех учеников", "Общий процент несовпадений для всех учеников"]
        writer.writerow(text)
        # В Microsoft excel и Google Sheets функция СЧЁТЗ, Libre office - СЧЁТА
        if platform == "posix":
            writer.writerow(["","","","","","","","","","","","","",
        '=СЦЕПИТЬ("1) "&ЦЕЛОЕ((СУММ(D3:D100)/(СЧЁТА(A3:A100)*22))*100)&"% "; СИМВОЛ(10); "2) "&ЦЕЛОЕ((СУММ(E3:E100)/(СЧЁТА(A3:A100)*11))*100)&"% "; СИМВОЛ(10); "3) "&ЦЕЛОЕ((СУММ(F3:F100)/(СЧЁТА(A3:A100)*13))*100)&"% "; СИМВОЛ(10); "4) "&ЦЕЛОЕ((СУММ(G3:G100)/(СЧЁТА(A3:A100)*6))*100)&"% "; СИМВОЛ(10); "5) "&ЦЕЛОЕ((СУММ(H3:H100)/(СЧЁТА(A3:A100)*6))*100)&"% "; СИМВОЛ(10); "6) "&ЦЕЛОЕ((СУММ(I3:I100)/(СЧЁТА(A3:A100)*5))*100)&"% "; СИМВОЛ(10); "7) "&ЦЕЛОЕ((СУММ(J3:J100)/(СЧЁТА(A3:A100)*5))*100)&"% "; СИМВОЛ(10); "8) "&ЦЕЛОЕ((СУММ(K3:K100)/(СЧЁТА(A3:A100)*8))*100)&"% ")',
        '=""&ЦЕЛОЕ((СУММ(C3:C100)/(СЧЁТА(A3:A100)*58))*100)&"%"'])

        elif platform == "nt":
            writer.writerow(["","","","","","","","","","","","","",
        '=СЦЕПИТЬ("1) "&ЦЕЛОЕ((СУММ(D3:D100)/(СЧЁТЗ(A3:A100)*22))*100)&"% "; СИМВОЛ(10); "2) "&ЦЕЛОЕ((СУММ(E3:E100)/(СЧЁТЗ(A3:A100)*11))*100)&"% "; СИМВОЛ(10); "3) "&ЦЕЛОЕ((СУММ(F3:F100)/(СЧЁТЗ(A3:A100)*13))*100)&"% "; СИМВОЛ(10); "4) "&ЦЕЛОЕ((СУММ(G3:G100)/(СЧЁТЗ(A3:A100)*6))*100)&"% "; СИМВОЛ(10); "5) "&ЦЕЛОЕ((СУММ(H3:H100)/(СЧЁТЗ(A3:A100)*6))*100)&"% "; СИМВОЛ(10); "6) "&ЦЕЛОЕ((СУММ(I3:I100)/(СЧЁТЗ(A3:A100)*5))*100)&"% "; СИМВОЛ(10); "7) "&ЦЕЛОЕ((СУММ(J3:J100)/(СЧЁТЗ(A3:A100)*5))*100)&"% "; СИМВОЛ(10); "8) "&ЦЕЛОЕ((СУММ(K3:K100)/(СЧЁТЗ(A3:A100)*8))*100)&"% ")',
        '=""&ЦЕЛОЕ((СУММ(C3:C100)/(СЧЁТЗ(A3:A100)*58))*100)&"%"'])
       

# Добавление данных в csv таблицу
def csv_write(results: dict) -> None:
    with open("data.csv", "a", encoding="utf-8") as csv_file:
        writer = csv.writer(csv_file,delimiter='|', quoting=csv.QUOTE_MINIMAL)
        text = [res for _, res in results.items()]
        writer.writerow(text)


